Revit 2017 API
StructuralSectionRound.SectionArea Property
 Cross section area.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public double SectionArea { get; set; }
Visual Basic
Public Property SectionArea As Double
	Get
	Set
Visual C++
public:
property double SectionArea {
	double get ();
	void set (double value);
}
See Also
StructuralSectionRound Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace